# Узнайте у пользователя число n.
# Найдите сумму чисел n + nn + nnn.
# Например, пользователь ввёл число 3. Считаем 3 + 33 + 333 = 369.

n=input("Введите число N: ")
print("Сумма чисел равна -> ", (int(n*1))+(int(n*2))+(int(n*3)))